chrissicool/l4openbsd/share/man/man4/man4.vax/mbus.4
.\"	$OpenBSD: mbus.4,v 1.2 2008/08/20 19:00:01 miod Exp $
.\"
.\" Copyright (c) 2008 Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: August 20 2008 $
.Dt MBUS 4 vax
.Os
.Sh NAME
.Nm mbus
.Nd VAXstation 35x0 and 38x0 bus
.Sh SYNOPSIS
.Cd "mbus0 at mainbus0"
.Sh DESCRIPTION
The
.Nm
driver supports the M-bus found in VAXstation 35x0 and 38x0 series.
It will perform the necessary configuration of all the boards connected
to the bus, and will attach a specific driver if necessary.
.Sh SUPPORTED DEVICES
The following M-bus devices are supported:
.Pp
.Bl -tag -width 8n -compact -offset indent
.It Xr fwio 4
Firefox Workstation I/O module
.It Xr legss 4
Low-End Graphics Subsystem
.It Xr uba 4
UNIBUS/Q-bus controller
.El
.Sh SEE ALSO
.Xr intro 4
